# TrussFamilyBottomChordStructuralTypesParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TrussFamilyBottomChordStructuralTypesParam Property
ParameterTypeId Class See Also
---
"Structural Framing Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TrussFamilyBottomChordStructuralTypesParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussFamilyBottomChordStructuralTypesParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TrussFamilyBottomChordStructuralTypesParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace